apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_flexcan.c
#ifdef CONFIG_S32K3XX_FLEXCAN0
static const struct flexcan_config_s s32k3xx_flexcan0_config =
{
  .tx_pin      = PIN_CAN0_TX,
  .rx_pin      = PIN_CAN0_RX,
  .no_buffers  = 64,
#ifdef PIN_CAN0_ENABLE
  .enable_pin  = PIN_CAN0_ENABLE,
  .enable_high = CAN0_ENABLE_OUT,
#else
  .enable_pin  = 0,
  .enable_high = 0,
#endif
#ifdef PIN_CAN0_STB
  .stb_pin  = PIN_CAN0_STB,
  .stb_high = CAN0_STB_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
#ifdef PIN_CAN0_LED
  .led_pin  = PIN_CAN0_LED,
  .led_high = CAN0_LED_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
  .bus_irq     = 0,
  .error_irq   = 0,
  .lprx_irq    = 0,
  .mb_irq      = S32K3XX_IRQ_FLEXCAN0_1,
};
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN1
static const struct flexcan_config_s s32k3xx_flexcan1_config =
{
  .tx_pin      = PIN_CAN1_TX,
  .rx_pin      = PIN_CAN1_RX,
  .no_buffers  = 64,
#ifdef PIN_CAN1_ENABLE
  .enable_pin  = PIN_CAN1_ENABLE,
  .enable_high = CAN1_ENABLE_OUT,
#else
  .enable_pin  = 0,
  .enable_high = 0,
#endif
#ifdef PIN_CAN1_STB
  .stb_pin  = PIN_CAN1_STB,
  .stb_high = CAN1_STB_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
#ifdef PIN_CAN1_LED
  .led_pin  = PIN_CAN1_LED,
  .led_high = CAN1_LED_OUT,
#else
  .led_pin  = 0,
  .led_high = 0,
#endif
  .bus_irq     = 0,
  .error_irq   = 0,
  .lprx_irq    = 0,
  .mb_irq      = S32K3XX_IRQ_FLEXCAN1_1,
};
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN2
static const struct flexcan_config_s s32k3xx_flexcan2_config =
{
  .tx_pin    = PIN_CAN2_TX,
  .rx_pin    = PIN_CAN2_RX,
  .no_buffers  = 64,
#ifdef PIN_CAN2_ENABLE
  .enable_pin  = PIN_CAN2_ENABLE,
  .enable_high = CAN2_ENABLE_OUT,
#else
  .enable_pin  = 0,
  .enable_high = 0,
#endif
#ifdef PIN_CAN2_STB
  .stb_pin  = PIN_CAN2_STB,
  .stb_high = CAN2_STB_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
#ifdef PIN_CAN2_LED
  .led_pin  = PIN_CAN2_LED,
  .led_high = CAN2_LED_OUT,
#else
  .led_pin  = 0,
  .led_high = 0,
#endif
  .bus_irq   = 0,
  .error_irq = 0,
  .lprx_irq  = 0,
  .mb_irq    = S32K3XX_IRQ_FLEXCAN2_1,
};
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN3
static const struct flexcan_config_s s32k3xx_flexcan3_config =
{
  .tx_pin    = PIN_CAN3_TX,
  .rx_pin    = PIN_CAN3_RX,
  .no_buffers  = 32,
#ifdef PIN_CAN3_ENABLE
  .enable_pin = PIN_CAN3_ENABLE,
  .enable_high = CAN3_ENABLE_OUT,
#else
  .enable_pin = 0,
  .rx_pin     = 0,
#endif
#ifdef PIN_CAN3_STB
  .stb_pin  = PIN_CAN3_STB,
  .stb_high = CAN3_STB_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
#ifdef PIN_CAN3_LED
  .led_pin  = PIN_CAN3_LED,
  .led_high = CAN3_LED_OUT,
#else
  .led_pin  = 0,
  .led_high = 0,
#endif
  .bus_irq   = 0,
  .error_irq = 0,
  .lprx_irq  = 0,
  .mb_irq    = S32K3XX_IRQ_FLEXCAN3_1,
};
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN4
static const struct flexcan_config_s s32k3xx_flexcan4_config =
{
  .tx_pin    = PIN_CAN4_TX,
  .rx_pin    = PIN_CAN4_RX,
  .no_buffers  = 32,
#ifdef PIN_CAN4_ENABLE
  .enable_pin = PIN_CAN4_ENABLE,
  .enable_high = CAN4_ENABLE_OUT,
#else
  .enable_pin  = 0,
  .enable_high = 0,
#endif
#ifdef PIN_CAN4_STB
  .stb_pin  = PIN_CAN4_STB,
  .stb_high = CAN4_STB_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
#ifdef PIN_CAN4_LED
  .led_pin  = PIN_CAN4_LED,
  .led_high = CAN4_LED_OUT,
#else
  .led_pin  = 0,
  .led_high = 0,
#endif
  .bus_irq   = 0,
  .error_irq = 0,
  .lprx_irq  = 0,
  .mb_irq    = S32K3XX_IRQ_FLEXCAN4_1,
};
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN5
static const struct flexcan_config_s s32k3xx_flexcan5_config =
{
  .tx_pin    = PIN_CAN5_TX,
  .rx_pin    = PIN_CAN5_RX,
  .no_buffers  = 32,
#ifdef PIN_CAN5_ENABLE
  .enable_pin = PIN_CAN5_ENABLE,
  .enable_high = CAN5_ENABLE_OUT,
#else
  .enable_pin  = 0,
  .enable_high = 0,
#endif
#ifdef PIN_CAN5_STB
  .stb_pin  = PIN_CAN5_STB,
  .stb_high = CAN5_STB_OUT,
#else
  .stb_pin  = 0,
  .stb_high = 0,
#endif
#ifdef PIN_CAN5_LED
  .led_pin  = PIN_CAN5_LED,
  .led_high = CAN5_LED_OUT,
#else
  .led_pin  = 0,
  .led_high = 0,
#endif
  .bus_irq   = 0,
  .error_irq = 0,
  .lprx_irq  = 0,
  .mb_irq    = S32K3XX_IRQ_FLEXCAN5_1,
};
#endif

/* The s32k3xx_driver_s encapsulates all state information for a single
 * hardware interface
 */

struct s32k3xx_driver_s
{
  uint32_t base;                /* FLEXCAN base address */
  uint32_t clk_freq;            /* Pheriperal engine clock freq */
  bool bifup;                   /* true:ifup false:ifdown */
#ifdef TX_TIMEOUT_WQ
  struct wdog_s txtimeout[TXMBCOUNT]; /* TX timeout timer */
#endif
  struct work_s irqwork;        /* For deferring interrupt work to the wq */
  struct work_s pollwork;       /* For deferring poll work to the work wq */
#ifdef CONFIG_NET_CAN_CANFD
  struct canfd_frame *txdesc;   /* A pointer to the list of TX descriptor */
  struct canfd_frame *rxdesc;   /* A pointer to the list of RX descriptors */
#else
  struct can_frame *txdesc;     /* A pointer to the list of TX descriptor */
  struct can_frame *rxdesc;     /* A pointer to the list of RX descriptors */
#endif

  /* This holds the information visible to the NuttX network */

  struct net_driver_s dev;      /* Interface understood by the network */

  struct mb_s *rx;
  struct mb_s *tx;

  struct flexcan_timeseg arbi_timing; /* Timing for arbitration phase */
#ifdef CONFIG_NET_CAN_CANFD
  struct flexcan_timeseg data_timing; /* Timing for data phase */
#endif

  const struct flexcan_config_s *config;

#ifdef CONFIG_NET_CAN_RAW_TX_DEADLINE
  struct txmbstats txmb[TXMBCOUNT];
#endif
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_FLEXCAN0
static struct s32k3xx_driver_s g_flexcan0;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN1
static struct s32k3xx_driver_s g_flexcan1;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN2
static struct s32k3xx_driver_s g_flexcan2;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN3
static struct s32k3xx_driver_s g_flexcan3;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN4
static struct s32k3xx_driver_s g_flexcan4;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN5
static struct s32k3xx_driver_s g_flexcan5;
#endif

#ifdef CONFIG_NET_CAN_CANFD
static uint8_t g_tx_pool[(sizeof(struct canfd_frame)+MSG_DATA)*POOL_SIZE];
static uint8_t g_rx_pool[(sizeof(struct canfd_frame)+MSG_DATA)*POOL_SIZE];
#else
static uint8_t g_tx_pool[sizeof(struct can_frame)*POOL_SIZE];
static uint8_t g_rx_pool[sizeof(struct can_frame)*POOL_SIZE];
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: arm_lsb
 *
 * Description:
 *   Calculate position of lsb that's equal to 1
 *
 * Input Parameters:
 *   value - The value to perform the operation on
 *
 * Returned Value:
 *   location of lsb which is equal to 1, returns 32 when value is 0
 *
 ****************************************************************************/

