apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_flexcan.c
  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      ninfo("MB %" PRIu32 " %p\n", i, &priv->rx[i]);
      ninfo("MB %" PRIu32 " %p\n", i, &priv->rx[i].id.w);
      priv->rx[i].cs.cs = 0x0;
      priv->rx[i].id.w = 0x0;
      priv->rx[i].data[0].w00 = 0x0;
      priv->rx[i].data[1].w00 = 0x0;
    }

  regval  = getreg32(priv->base + S32K3XX_CAN_MCR_OFFSET);
  regval |= CAN_MCR_WRNEN | CAN_MCR_SRXDIS |
            CAN_MCR_IRMQ | CAN_MCR_AEN |
            (((TOTALMBCOUNT - 1) << CAN_MCR_MAXMB_SHIFT) &
            CAN_MCR_MAXMB_MASK);
  putreg32(regval, priv->base + S32K3XX_CAN_MCR_OFFSET);

  regval  = CAN_CTRL2_RRS | CAN_CTRL2_EACEN;
  putreg32(regval, priv->base + S32K3XX_CAN_CTRL2_OFFSET);

  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      putreg32(0, priv->base + S32K3XX_CAN_RXIMR_OFFSET(i));
    }

  /* Filtering catchall */

  putreg32(0x3fffffff, priv->base + S32K3XX_CAN_RX14MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + S32K3XX_CAN_RX15MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + S32K3XX_CAN_RXMGMASK_OFFSET);
  putreg32(0x0, priv->base + S32K3XX_CAN_RXFGMASK_OFFSET);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: s32k3xx_caninitialize
 *
 * Description:
 *   Initialize the CAN controller and driver
 *
 * Input Parameters:
 *   intf - In the case where there are multiple CAN devices, this value
 *          identifies which CAN device is to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int s32k3xx_caninitialize(int intf)
{
  struct s32k3xx_driver_s *priv;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_S32K3XX_FLEXCAN0
    case 0:
      priv               = &g_flexcan0;
      memset(priv, 0, sizeof(struct s32k3xx_driver_s));
      priv->base         = S32K3XX_FLEXCAN0_BASE;
      priv->config       = &s32k3xx_flexcan0_config;
      priv->clk_freq     = s32k3xx_get_freq(FLEXCAN0_CLK);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN0_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN0_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN0_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN0_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN0_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN0_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN1
    case 1:
      priv               = &g_flexcan1;
      memset(priv, 0, sizeof(struct s32k3xx_driver_s));
      priv->base         = S32K3XX_FLEXCAN1_BASE;
      priv->config       = &s32k3xx_flexcan1_config;
      priv->clk_freq     = s32k3xx_get_freq(FLEXCAN1_CLK);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN1_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN1_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN1_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN1_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN1_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN1_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN2
    case 2:
      priv               = &g_flexcan2;
      memset(priv, 0, sizeof(struct s32k3xx_driver_s));
      priv->base         = S32K3XX_FLEXCAN2_BASE;
      priv->config       = &s32k3xx_flexcan2_config;
      priv->clk_freq     = s32k3xx_get_freq(FLEXCAN2_CLK);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN2_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN2_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN2_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN2_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN3
    case 3:
      priv               = &g_flexcan3;
      memset(priv, 0, sizeof(struct s32k3xx_driver_s));
      priv->base         = S32K3XX_FLEXCAN3_BASE;
      priv->config       = &s32k3xx_flexcan3_config;
      priv->clk_freq     = s32k3xx_get_freq(FLEXCAN3_CLK);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN3_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN3_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN3_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN3_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN3_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN3_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN4
    case 4:
      priv               = &g_flexcan4;
      memset(priv, 0, sizeof(struct s32k3xx_driver_s));
      priv->base         = S32K3XX_FLEXCAN4_BASE;
      priv->config       = &s32k3xx_flexcan4_config;
      priv->clk_freq     = s32k3xx_get_freq(FLEXCAN4_CLK);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN4_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN4_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN4_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN4_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN4_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN4_SAMPLEP;
#  endif
      break;
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN5
    case 5:
      priv               = &g_flexcan5;
      memset(priv, 0, sizeof(struct s32k3xx_driver_s));
      priv->base         = S32K3XX_FLEXCAN5_BASE;
      priv->config       = &s32k3xx_flexcan5_config;
      priv->clk_freq     = s32k3xx_get_freq(FLEXCAN5_CLK);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN5_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN5_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN5_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN5_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN5_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN5_SAMPLEP;
#  endif
      break;
#endif

    default:
      return -ENODEV;
    }

