apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_flexcan.c
  if (!s32k3xx_bitratetotimeseg(&priv->arbi_timing, 1, 0, priv->clk_freq))
    {
      nerr("ERROR: Invalid CAN timings please try another sample point "
           "or refer to the reference manual\n");
      return -1;
    }

#ifdef CONFIG_NET_CAN_CANFD
  if (!s32k3xx_bitratetotimeseg(&priv->data_timing, 1, 1, priv->clk_freq))
    {
      nerr("ERROR: Invalid CAN data phase timings please try another "
           "sample point or refer to the reference manual\n");
      return -1;
    }
#endif

  s32k3xx_pinconfig(priv->config->tx_pin);
  s32k3xx_pinconfig(priv->config->rx_pin);
  if (priv->config->enable_pin > 0)
    {
      s32k3xx_pinconfig(priv->config->enable_pin);
      s32k3xx_gpiowrite(priv->config->enable_pin, priv->config->enable_high);
    }

  if (priv->config->stb_pin > 0)
    {
      s32k3xx_pinconfig(priv->config->stb_pin);
      s32k3xx_gpiowrite(priv->config->stb_pin, priv->config->stb_high);
    }

  /* Attach the flexcan interrupt handler */

  if (priv->config->bus_irq > 0)
      {
      if (irq_attach(priv->config->bus_irq, s32k3xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN bus IRQ\n");
          return -EAGAIN;
        }
      }

  if (priv->config->error_irq > 0)
      {
      if (irq_attach(priv->config->error_irq,
                     s32k3xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN error IRQ\n");
          return -EAGAIN;
        }
      }

  if (priv->config->lprx_irq > 0)
    {
      if (irq_attach(priv->config->lprx_irq,
                     s32k3xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN LPRX IRQ\n");
          return -EAGAIN;
        }
    }

  if (irq_attach(priv->config->mb_irq, s32k3xx_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN OR'ed Message buffer (0-15) IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  priv->dev.d_ifup    = s32k3xx_ifup;      /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = s32k3xx_ifdown;    /* I/F down callback */
  priv->dev.d_txavail = s32k3xx_txavail;   /* New TX data callback */
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = s32k3xx_ioctl;     /* Support CAN ioctl() calls */
#endif
  priv->dev.d_private = priv;              /* Used to recover private state from dev */
  priv->rx            = (struct mb_s *)(priv->base + S32K3XX_CAN_MB_OFFSET);
  priv->tx            = (struct mb_s *)(priv->base + S32K3XX_CAN_MB_OFFSET +
                          (sizeof(struct mb_s) * RXMBCOUNT));

  /* Put the interface in the down state.  This usually amounts to resetting
   * the device and/or calling s32k3xx_ifdown().
   */

  ninfo("callbacks done\n");

  s32k3xx_initialize(priv);

  s32k3xx_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_CAN);

  UNUSED(ret);
  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the enabled CAN device interfaces.  If there are more
 *   different network devices in the chip, then board-specific logic will
 *   have to provide this function to determine which, if any, network
 *   devices should be initialized.
 *
 ****************************************************************************/

#if !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
#ifdef CONFIG_S32K3XX_FLEXCAN0
  s32k3xx_caninitialize(0);
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN1
  s32k3xx_caninitialize(1);
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN2
  s32k3xx_caninitialize(2);
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN3
  s32k3xx_caninitialize(3);
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN4
  s32k3xx_caninitialize(4);
#endif

#ifdef CONFIG_S32K3XX_FLEXCAN5
  s32k3xx_caninitialize(5);
#endif
}
#endif

#endif /* CONFIG_S32K3XX_FLEXCAN */
